a = float(input("შეიყვანეთ სამკუთედის პირველი გვერდი: "))
b = float(input("შეიყვანეთ სამკუთედის მეორე გვერდი: "))
c = float(input("შეიყვანეთ სამკუთხედის მესამე გვერდი "))
if a + b > c  and a + c > b and b + c > a:
    print('სამკუთხედის გვერდები მისაღებია: ')
    p = a + b + c
    print("სამკუთხედის პერიმეტრია: ", p)
    s = p /2
    area = (s * (s -a) * (s -b) * (s - c)) ** 0.5
    print("სამკუთხედის ფართობია: ", area)
else:
    print('მოცემული გვერდებით სამკუთედი არ შედგება \nსცადეთ ხელახლა' )